onghoaibao/Reader_RFID_Master/Implementation/ESP8266/Reader/headerFile.h
#ifndef __HEADER__
#define __HEADER__

#include "Arduino.h"
#include <ESP8266WiFi.h>
//#include <ESP8266HTTPClient.h>
#include <ESP8266WebServer.h>
#include <FS.h>
#include <EEPROM.h>
#include <SoftwareSerial.h>
#include <WiFiClientSecure.h>

// Init server and client
ESP8266WebServer sv(9090);

#define SIZE 60
#define SIZE_SSID 30
#define SIZE_PASS 20
#define ADDRESS_SSID_WIFI 0 
#define ADDRESS_PASS_WIFI 35

void serialFlush();
String hexToASCII(unsigned long n);

// declare variables for the google sheet
const char* NAME_WIFI_ESP8266 = "ESP_Manage";
const char* PASS_WIFI_ESP8266  = "123456789";
String url = "/macros/s/AKfycbyv6koMALyPSHIlVG8pp0ysDgmIaA-csMx4bB05utsQZXlJKN0/exec?tag=ohbao&value=1233";

String ssid =  "";
String pass =  "";

String bLogin = "";
const char* __host__ = "script.google.com";
const int __httpsPort__ = 443; //the https port is same

void setupWiFi();
void handleClientServer();
void client_Sendata(String code);
String getAllDeviveFromDataBase();
String scanWifi();

//
typedef struct Nodes
{
   String sNodes_Data;
   struct Nodes *next;
} Node;

Node* head_data = NULL;

void append(Node** head, String sData);
void deleteList();
bool isElementInStruct(Node* head_ref, String str);
void displayStruct();
void appendWithoutRepeat(String str);

// FILE FS
boolean saveFile(String fileName, const char* content, uint16_t len);
String getStringFile(String fileName);
void removeContentFile(String fileName);
void listALlFile(String path);
String read200Line();

//EEPROM
void savePASSWifi(String pass);
void saveSSIDWifi(String ssid);
void accessWifi(String ssid, String pass);
String getSSID_WIFI();
String getPASS_WIFI();
void clearEEPROM(int _address, int _size);
String readEEPROM(int _address, int _size);
void writeEEPROM(String str, int _address, int _SIZE_);


//Google Sheet
String getURL(String maThietBi, String properties_name, String properties_sx,
              String trangthai, String dvMuon, String ngayTra, String lsdc, String hientai);
String getStatusMaThietBi(String maThietbi);
void client_Sendata(String maThietbi, String pos);

// Sim800L
SoftwareSerial SIM800L(D6, D7); // RX, TX
void sendAT_Sim800l(String cmd);
void readInfoSim800l();
void sendMessage();

// Reader RFID
SoftwareSerial RFID(D2, D3); // RX, TX
void readDataRFID();
void initReaderRFID();
String hexToASCII(unsigned long n);

#endif
